[
  {
    "title": "Apocalypse Now",
    "genre": "War, Mystery, Drama",
    "year": "1979",
    "plot": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him. Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard & the others be able to fulfill their mission?",
    "rating": "5",
    "id": 271,
    "poster": "https://m.media-amazon.com/images/I/41TUHqMRtML.jpg"
  },
  {
    "title": "Full Metal Jacket",
    "genre": "War, Drama",
    "year": "1987",
    "plot": "A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive.",
    "rating": "5",
    "id": 272,
    "poster": "https://m.media-amazon.com/images/I/71NII14aYRL._SL1348_.jpg"
  },
  {
    "title": "Up",
    "genre": "Animation, Adventure, Comedy, Drama, Family, Sadness",
    "year": "2009",
    "plot": "As a boy, Carl Fredricksen wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with Boy Scout Russell by lifting his house with thousands of balloons. On their journey, they make many new friends including a talking dog, and figure out that someone has evil plans. Carl soon realizes that this evildoer is his childhood idol.",
    "rating": "5",
    "id": 273,
    "poster": "https://m.media-amazon.com/images/I/51h4mgekRdL.jpg"
  },
  {
    "title": "A Clockwork Orange",
    "genre": "Crime, Sci-fi",
    "year": "1971",
    "plot": "Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the streets of Britain.",
    "rating": "5",
    "id": 274,
    "poster": "https://m.media-amazon.com/images/I/51LpNVSPR0L.jpg"
  },
  {
    "title": "Dumb And Dumber",
    "genre": "Comedy",
    "year": "1994",
    "plot": "Harry and Lloyd are two good friends who happen to be really stupid. The duo set out on a cross country trip from Providence to Aspen, Colorado to return a briefcase full of money to its rightful owner, a beautiful woman named Mary Swanson. After a trip of one mishap after another, the duo eventually make it to Aspen. But the two soon realize that Mary and her briefcase are the least of their problems.",
    "rating": "4",
    "id": 275,
    "poster": "https://m.media-amazon.com/images/I/51XVZYDA0ZL.jpg"
  },
  {
    "title": "Requiem For A Dream",
    "genre": "Drama, Sadness",
    "year": "2000",
    "plot": "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.",
    "rating": "4",
    "id": 276,
    "poster": "https://m.media-amazon.com/images/I/71-b2P2qoeL._SY606_.jpg"
  },
  {
    "title": "Snatch",
    "genre": "Crime, Comedy",
    "year": "2000",
    "plot": "Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Mickey, who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off of Travellers. They then try to convince Mickey not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog.",
    "rating": "5",
    "id": 277,
    "poster": "https://m.media-amazon.com/images/I/51B3aA0c5OL.jpg"
  },
  {
    "title": "Enron: The Smartest Guys In The Room",
    "genre": "Documentary",
    "year": "2005",
    "plot": "Enron dives from the seventh largest US company to bankruptcy in less than a year in this tale told chronologically. The emphasis is on human drama, from suicide to 20,000 people sacked: the personalities of Ken Lay (with Falwellesque rectitude), Jeff Skilling (he of big ideas), Lou Pai (gone with $250 M), and Andy Fastow (the dark prince) dominate. Along the way, we watch Enron game California's deregulated electricity market, get a free pass from Arthur Andersen (which okays the dubious mark-to-market accounting), use greed to manipulate banks and brokerages (Merrill Lynch fires the analyst who questions Enron's rise), and hear from both Presidents Bush what great guys these are.",
    "rating": "4",
    "id": 279,
    "poster": "https://m.media-amazon.com/images/I/513D2SBB5YL.jpg"
  },
  {
    "title": "The Vietnam War",
    "genre": "Documentary, History, War",
    "year": "2017",
    "plot": "\nKen Burns and Lynn Novick's ten-part, 18-hour documentary series, THE VIETNAM WAR, tells the epic story of one of the most consequential, divisive, and controversial events in American history as it has never before been told on film. Visceral and immersive, the series explores the human dimensions of the war through revelatory testimony of nearly 80 witnesses from all sides-Americans who fought in the war and others who opposed it, as well as combatants and civilians from North and South Vietnam. Ten years in the making, the series includes rarely seen and digitally re-mastered archival footage from sources around the globe, photographs taken by some of the most celebrated photojournalists of the 20th Century, historic television broadcasts, evocative home movies, and secret audio recordings from inside the Kennedy, Johnson, and Nixon administrations. THE VIETNAM WAR features more than 100 iconic musical recordings from greatest artists of the era and haunting original music from Trent Reznor and Atticus Ross as well as the Silk Road Ensemble featuring Yo-Yo Ma.",
    "rating": "5",
    "id": 280,
    "poster": "https://m.media-amazon.com/images/I/41-CEtp2OWL.jpg"
  },
  {
    "title": "Apollo 13",
    "genre": "Adventure, Drama, History",
    "year": "1995",
    "plot": "Based on the true story of the ill-fated 13th Apollo mission bound for the moon. Astronauts Lovell, Haise and Swigert were scheduled to fly Apollo 14, but are moved up to 13. It's 1970, and The US has already achieved their lunar landing goal, so there's little interest in this \"routine\" flight.. until that is, things go very wrong, and prospects of a safe return fade.",
    "rating": "3",
    "id": 281,
    "poster": "https://m.media-amazon.com/images/I/81KF+c8qrBL._SY606_.jpg"
  },
  {
    "title": "Top Gun",
    "genre": "Action, Drama",
    "year": "1986",
    "plot": "Call-sign \"Maverick\", LT Pete Mitchell, the impetuous daredevil Navy-pilot ace, is accepted into Miramar's elite Fighter School, also known as \"Top Gun\". There, as the impulsive pilot competes with the best of the best, not only will he meet Charlie, the flying school's curvaceous astrophysics instructor, but also the brilliant and highly competitive fellow student, \"Iceman\", with whom right from the start, he will engage in a reckless contest. As Maverick is haunted by his father's mysterious death, will he be able to suppress his wild nature to win the prestigious Top Gun Trophy?",
    "rating": "4",
    "id": 282,
    "poster": "https://m.media-amazon.com/images/I/91ThV-kDYOL._SY606_.jpg"
  },
  {
    "title": "Interstellar",
    "genre": "Sci-Fi, Adventure, Drama",
    "year": "2004",
    "plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
    "rating": "4",
    "poster": "https://m.media-amazon.com/images/I/A1JVqNMI7UL._SL1500_.jpg",
    "id": 283
  },
  {
    "title": "Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
    "genre": "Comedy, Documentary",
    "year": "2006",
    "plot": "Borat Sagdiyev is a TV reporter of a popular show in Kazakhstan as Kazakhstan's sixth most famous man and a leading journalist. He is sent from his home to America by his government to make a documentary about American society and culture. Borat takes a course in New York City to understand American humor. While watching Baywatch on TV, Borat discovers how beautiful their women are in the form of C. J. Parker, who was played by actress Pamela Anderson who hails from Malibu, California. He decides to go on a cross-country road trip to California in a quest to make her his wife and take her back to his country. On his journey Borat and his producer encounter a country full of strange and wonderful Americans, real people in real chaotic situations with hysterical consequences.",
    "rating": "5",
    "poster": "https://m.media-amazon.com/images/I/51mjmxfS-AL.jpg",
    "id": 284
  },
  {
    "title": "Team America: World Police",
    "genre": "Action, Comedy",
    "year": "2006",
    "plot": "The North American counter-terrorism force Team America attacks a group of terrorists in Paris. Later, the leader of the organization, Spottswoode, invites the famous Broadway actor Gary Johnston to join his world police and work undercover in Cairo, infiltrating a terrorist organization in the hope they will disclose their plan of destroying the world. Team America destroy the cell of terrorists, but then the Panama Canal is attacked by the criminals as a payback. Gary feels responsible for the death of many innocents and leaves the counter-terrorism organization. When the leader of North Korea, Kim Jong Il, joins a group of pacifist actors and actresses with the intention of using weapons of massive destruction, Team America tries to avoid the destruction of the world.",
    "rating": "5",
    "poster": "https://m.media-amazon.com/images/I/91NJ51anWeL._SL1500_.jpg",
    "id": 285
  },
  {
    "title": "Reefer Madness",
    "genre": "Propaganda, Crime",
    "year": "1936",
    "plot": "Film that relates the story, as told by high school principal Dr. Carroll to parents at a PTA meeting, of the scourge of marijuana. The tale revolves around Mae and Jack, accomplices in the distribution of marijuana, who manage to entice the local high school kids to stop by Mae's apartment to smoke reefer. The lives of all who are involved with this menace are inevitably shattered. One man becomes so addicted to the killer weed that the guilt over framing a teen for murder causes a judge to order him to be committed for life to a mental hospital. Dr. Carroll closes by advising us to not incur the same tragedy.",
    "rating": "1",
    "poster": "https://m.media-amazon.com/images/I/51-p3YCXoiL.jpg",
    "id": 286
  },
  {
    "title": "Birdemic",
    "genre": "Horror, Thriller",
    "year": "2010",
    "plot": "In the town of Half Moon Bay California, there's an epidemic on the horizon: a Birdemic. All the birds are attacking humanity for their devastating damage they're inflicting on the Earth: they're going after gas stations and people's cars, and the birds have something the humans will never see coming: Bird-Acid.",
    "rating": "1",
    "poster": "https://m.media-amazon.com/images/I/71DSNe2miJL._SL1500_.jpg",
    "id": 287
  },
  {
    "title": "The Matrix",
    "genre": "Action, Sci-Fi",
    "year": "1999",
    "plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion.",
    "rating": "5",
    "poster": "https://m.media-amazon.com/images/I/51vpnbwFHrL.jpg",
    "id": 288
  },
  {
    "title": "Dune",
    "genre": "Sci-Fi, Adventure",
    "year": "1984",
    "plot": "In the distant year of 10191, all the planets of the known Universe are under the control of Padishah Emperor Shaddam IV and the most important commodity in the Universe is a substance called the spice \"MELANGE\" which is said to have the power of extending life, expanding the consciousness and even to \"fold space\" ; being able to travel to any distance without physically moving. This spice \"MELANGE\" is said to only be produced in the desert planet of Arrakis, where the FREMEN people have the prophecy of a man who will lead them to true freedom. This \"desert planet\"of Arrakis is also known as DUNE. A secret report of the space \"GUILD\" talks about some circumstances and plans that could jeopardize the production of \"SPICE\" with four planets involved: ARRAKIS, CALADAN, GIEDI PRIME and KAITAIN, a world at least visually very alike to Earth and house of the Emperor of the known Universe. The \"GUILD\" sends a third stage navigator to KAITAIN to ask details from the Emperor and to demand him the killing of young Paul Atreides, son of the Duke Leto Atreides of CALADAN.",
    "rating": "5",
    "poster": "https://m.media-amazon.com/images/I/81DfqEHInEL._AC_UY436_FMwebp_QL65_.jpg",
    "id": 289
  },
  {
    "title": "Twilight",
    "genre": "Drama, Fantasy, Romance",
    "year": "2008",
    "plot": "Bella Swan has always been a little bit different. Never one to run with the crowd, Bella never cared about fitting in with the trendy girls at her Phoenix, Arizona high school. When her mother remarries and Bella chooses to live with her father in the rainy little town of Forks, Washington, she doesn't expect much of anything to change. But things do change when she meets the mysterious and dazzlingly beautiful Edward Cullen. For Edward is nothing like any boy she's ever met. He's nothing like anyone she's ever met, period. He's intelligent and witty, and he seems to see straight into her soul. In no time at all, they are swept up in a passionate and decidedly unorthodox romance - unorthodox because Edward really isn't like the other boys. He can run faster than a mountain lion. He can stop a moving car with his bare hands. Oh, and he hasn't aged since 1918. Like all vampires, he's immortal. That's right - vampire. But he doesn't have fangs - that's just in the movies. And he doesn't drink human blood, though Edward and his family are unique among vampires in that lifestyle choice. To Edward, Bella is that thing he has waited 90 years for - a soul mate. But the closer they get, the more Edward must struggle to resist the primal pull of her scent, which could send him into an uncontrollable frenzy. Somehow or other, they will have to manage their unmanageable love. But when unexpected visitors come to town and realize that there is a human among them Edward must fight to save Bella? A modern, visual, and visceral Romeo and Juliet story of the ultimate forbidden love affair - between vampire and mortal.",
    "rating": "2",
    "poster": "https://m.media-amazon.com/images/I/91ULn6UTnEL._SL1500_.jpg",
    "id": 290
  }
]